In [2]:
import numpy as np
import pandas as pd

In [2]:
# AULA DE SERIES

In [3]:
labels = ['a', 'b', 'c']

In [4]:
lista = [10 , 20, 30]
arr = np.array([10, 20, 30])
dic = { 'a': 10, 'b': 20, 'c': 30 }

In [5]:
series = pd.Series(data = lista, index = labels)
series

a    10
b    20
c    30
dtype: int64

In [6]:
series['a']

10

In [7]:
coe = pd.Series([print, len], ['printa isso', 'qual é o tamanho'])
coe

printa isso         <built-in function print>
qual é o tamanho      <built-in function len>
dtype: object

In [8]:
coe['printa isso']('oi')

oi

In [9]:
coe['qual é o tamanho']([1, 2, 3, 4, 5])

5

In [10]:
ser1 = pd.Series([1, 2, 3, 4], ['EUA', 'Alemanha', 'URSS', 'Japão'])
ser1

EUA         1
Alemanha    2
URSS        3
Japão       4
dtype: int64

In [11]:
ser2 = pd.Series([1, 2, 3, 4], [ 'Alemanha', 'EUA', 'Itália', 'Japão'])
ser2

Alemanha    1
EUA         2
Itália      3
Japão       4
dtype: int64

In [12]:
ser1 + ser2

Alemanha    3.0
EUA         3.0
Itália      NaN
Japão       8.0
URSS        NaN
dtype: float64

In [ ]:
# AULA DE DATA FRAME - CRIAÇÃO E FATIAMENTO

In [4]:
from numpy.random import randn
np.random.seed(101)

In [5]:
df = pd.DataFrame(np.random.randn(5,4), index = 'A B C D E'.split(), columns = "W X Y Z".split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [6]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [7]:
df[['Z', 'W']]

          Z         W
A  0.503826  2.706850
B  0.605965  0.651118
C -0.589001 -2.018168
D  0.955057  0.188695
E  0.683509  0.190794

In [8]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [9]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [10]:
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [12]:
df.drop('new', axis = 1, inplace = True)
# ou df = df.drop('new', axis=1)

In [13]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df.loc['A', 'W']

2.706849839399938

In [15]:
df.loc[['A', 'C'], ['Y', 'W', 'Z']]

          Y         W         Z
A  0.907969  2.706850  0.503826
C  0.528813 -2.018168 -0.589001

In [16]:
df.iloc[1:4, 2:]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

In [17]:
# AULA DE DATA FRAME - SELEÇÃO CONDICIONAL, SET_INDEX

In [21]:
np.random.seed(101)
df = pd.DataFrame(np.random.randn(5,4), index = 'A B C D E'.split(), columns = "W X Y Z".split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [23]:
bol = df > 0

In [24]:
df[bol]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df[df['W'] > 0] # remove a linha que não tem um número maior que zero na coluna W

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
bol = df['W']>0
bol

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [26]:
df2 = df[bol]
df2

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df2['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [30]:
# Equivalente às 3 últimas células.
df[df['W']>0]['Y'] # Pega os valores da coluna Y cujas linhas tem valores maiores do que zero na coluna W

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [31]:
df[(df['W']>0) & (df['Y']>1)] # Linha do df que atende as duas condicionais

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.reset_index() # inplace=True como parâmetro para salvar a alteração no df original

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [33]:
col = 'RS RJ SP AM SC'.split()
col

['RS', 'RJ', 'SP', 'AM', 'SC']

In [35]:
df['Estado'] = col
df

          W         X         Y         Z Estado
A  2.706850  0.628133  0.907969  0.503826     RS
B  0.651118 -0.319318 -0.848077  0.605965     RJ
C -2.018168  0.740122  0.528813 -0.589001     SP
D  0.188695 -0.758872 -0.933237  0.955057     AM
E  0.190794  1.978757  2.605967  0.683509     SC

In [36]:
df.set_index('Estado')

               W         X         Y         Z
Estado
RS      2.706850  0.628133  0.907969  0.503826
RJ      0.651118 -0.319318 -0.848077  0.605965
SP     -2.018168  0.740122  0.528813 -0.589001
AM      0.188695 -0.758872 -0.933237  0.955057
SC      0.190794  1.978757  2.605967  0.683509

In [37]:
# AULA DE DATA FRAME - ÍNDICES MULTINÍVEIS

In [40]:
# Níveis de Índice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]

In [43]:
hier_index = list(zip(outside,inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [44]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [48]:
df = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns=['A','B'])
df

             A         B
G1 1 -0.925874  1.862864
   2 -1.133817  0.610478
   3  0.386030  2.084019
G2 1 -0.376519  0.230336
   2  0.681209  1.035125
   3 -0.031160  1.939932

In [49]:
df.loc['G1']

          A         B
1 -0.925874  1.862864
2 -1.133817  0.610478
3  0.386030  2.084019

In [50]:
df.loc['G1'].loc[1]

A   -0.925874
B    1.862864
Name: 1, dtype: float64

In [51]:
df.index.names

FrozenList([None, None])

In [52]:
df.index.names = ['Grupo', 'Número']
df

                     A         B
Grupo Número
G1    1      -0.925874  1.862864
      2      -1.133817  0.610478
      3       0.386030  2.084019
G2    1      -0.376519  0.230336
      2       0.681209  1.035125
      3      -0.031160  1.939932

In [55]:
df.xs(1, level='Número')

              A         B
Grupo
G1    -0.925874  1.862864
G2    -0.376519  0.230336

In [56]:
# AULA DE DATA FRAME - DADOS AUSENTE

In [57]:
d = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [58]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [59]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [61]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [63]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [64]:
df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [65]:
# AULA DE DATAFRAME - GROUPBY

In [66]:
# Cria um DataFrame
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [67]:
df = pd.DataFrame(data)
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [70]:
group = df.groupby('Empresa')
group

In [71]:
group.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [72]:
group.mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [74]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [73]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [75]:
group = df.groupby('Nome')
group

In [76]:
group.sum().loc['Amy']

Venda    340
Name: Amy, dtype: int64

In [79]:
# AULA DE DATAFRAME - CONCATENAR, JUNTAR E MESCLAR (CÓDIGO NO ARQUIVO "Mesclar, Juntar e Concatenar" DA PASTA DO CURSO)

In [ ]:
# AULA DE DATAFRAME - OPERAÇÕES

In [18]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
np.unique(df['col2'])

array([444, 555, 666], dtype=int64)

In [6]:
df['col2'].nunique()

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [9]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [10]:
def vezes2(x):
    return x*2

In [11]:
df['col1'].sum()

10

In [12]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [13]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [14]:
df['col1'].apply(lambda x: x*x)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [15]:
del df['col2']
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [16]:
df.columns

Index(['col1', 'col3'], dtype='object')

In [17]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [20]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [21]:
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [25]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],'col2':[np.nan,555,666,444],'col3':['abc','def','ghi','xyz']})
df['col1'].fillna(value=df['col1'].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [27]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [28]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [29]:
# AULA DE DATA FRAME - ENTRADA E SAÍDA DE DADOS

In [34]:
df = pd.read_csv('Python-Data-Science-and-Machine-Learning-Bootcamp/2. Python para análise de dados/Pandas/exemplo', sep=',')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [36]:
df = df + 1
df

    a   b   c   d
0   2   3   4   5
1   6   7   8   9
2  10  11  12  13
3  14  15  16  17

In [37]:
df.to_csv('Python-Data-Science-and-Machine-Learning-Bootcamp/2. Python para análise de dados/Pandas/exemplo.csv',
          sep=';', decimal=',')

In [40]:
df = pd.read_excel('Python-Data-Science-and-Machine-Learning-Bootcamp/2. Python para análise de dados/Pandas/Exemplo_Excel.xlsx',
                   sheet_name='Sheet1')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [43]:
df.columns

Index(['Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [44]:
del df['Unnamed: 0']

In [45]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [49]:
df.to_excel('Python-Data-Science-and-Machine-Learning-Bootcamp/2. Python para análise de dados/Pandas/exemplo.xlsx', sheet_name='Sheet1')

In [51]:
df = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/banklist.html')
df

[                             Bank Name               City  ST   CERT  \
 0                    Almena State Bank             Almena  KS  15426
 1           First City Bank of Florida  Fort Walton Beach  FL  16748
 2                 The First State Bank      Barboursville  WV  14361
 3                   Ericson State Bank            Ericson  NE  18265
 4     City National Bank of New Jersey             Newark  NJ  21111
 ..                                 ...                ...  ..    ...
 558                 Superior Bank, FSB           Hinsdale  IL  32646
 559                Malta National Bank              Malta  OH   6629
 560    First Alliance Bank & Trust Co.         Manchester  NH  34264
 561  National State Bank of Metropolis         Metropolis  IL   3815
 562                   Bank of Honolulu           Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                            Equity Bank   October 23, 2020
 1              United Fidelity Bank, fsb   October 16, 2020
 2                         MVB Bank, Inc.      April 3, 2020
 3             Farmers and Merchants Bank  February 14, 2020
 4                        Industrial Bank   November 1, 2019
 ..                                   ...                ...
 558                Superior Federal, FSB      July 27, 2001
 559                    North Valley Bank        May 3, 2001
 560  Southern New Hampshire Bank & Trust   February 2, 2001
 561              Banterra Bank of Marion  December 14, 2000
 562                   Bank of the Orient   October 13, 2000

 [563 rows x 6 columns]]

In [52]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [59]:
df = pd.read_html('https://gol.gg/game/stats/25977/page-fullstats/')
df[0]

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,Player,Robo,Cariok,Tinowns,brTT,esA,Tyrin,st1ng,Anyyy,Stepz,Damage
1,Role,TOP,JUNGLE,MID,ADC,SUPPORT,TOP,JUNGLE,MID,ADC,SUPPORT
2,Kills,3,11,2,4,4,1,1,0,1,0
3,Deaths,0,0,3,0,0,3,5,5,4,7
4,Assists,11,7,6,11,14,0,1,2,1,3
5,KDA,Perfect KDA,Perfect KDA,2.7,Perfect KDA,Perfect KDA,0.3,0.4,0.4,0.5,0.4
6,CS,154,128,179,213,42,170,102,167,160,29
7,CS in Team's Jungle,1,49,8,12,0,1,62,8,0,0
8,CS in Enemy Jungle,0,23,4,4,0,0,16,0,0,0
9,CSM,7,5.8,8.1,9.7,1.9,7.7,4.6,7.6,7.3,1.3
10,Golds,8985,10466,9474,11158,7601,7412,5823,6643,6697,4477
11,GPM,408,475,430,507,345,337,264,302,304,203
12,GOLD%,18.8%,21.9%,19.9%,23.4%,15.9%,23.9%,18.8%,21.4%,21.6%,14.4%
13,Vision Score,14,46,26,32,58,17,19,10,17,29
14,Wards placed,9,20,10,9,26,9,6,5,10,25
15,Wards destroyed,0,9,3,7,9,2,7,4,7,6
16,Control Wards Purchased,2,6,5,4,11,2,5,1,4,6
17,VSPM,0.64,2.09,1.18,1.45,2.63,0.77,0.86,0.45,0.77,1.32
18,WPM,0.41,0.91,0.45,0.41,1.18,0.41,0.27,0.23,0.45,1.14
19,VWPM,0.09,0.27,0.23,0.18,0.5,0.09,0.23,0.05,0.18,0.27
20,WCPM,0,0.41,0.14,0.32,0.41,0.09,0.32,0.18,0.32,0.27
21,VS%,8%,26.1%,14.8%,18.2%,33%,18.5%,20.7%,10.9%,18.5%,31.5%
22,Total damage to Champion,7990,9864,10255,7685,8376,4050,2910,12966,7463,2801
23,Physical Damage,5475,697,320,6772,6174,4050,1986,56,5923,81
24,Magic Damage,2515,8523,9827,313,75,0,711,12910,1540,2720
25,True Damage,0,644,108,600,2127,0,213,0,0,0
26,DPM,363,448,466,349,380,184,132,589,339,127
27,DMG%,18.1%,22.3%,23.2%,17.4%,19%,13.4%,9.6%,42.9%,24.7%,9.3%
28,K+A Per Minute,0.64,0.82,0.36,0.68,0.82,0.05,0.09,0.09,0.09,0.14
29,KP%,58.3%,75%,33.3%,62.5%,75%,33.3%,66.7%,66.7%,66.7%,100%
30,Solo kills,NaN,2,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
31,Double kills,1,3,0,0,0,0,0,0,0,0
32,Triple kills,0,0,0,0,0,0,0,0,0,0
33,Quadra kills,0,0,0,0,0,0,0,0,0,0
34,Penta kills,0,0,0,0,0,0,0,0,0,0
35,GD@15,-322,1731,774,2253,1239,322,-1731,-774,-2253,-1239
36,CSD@15,-30,-1,-7,41,1,30,1,7,-41,-1
37,XPD@15,-338,1172,57,1179,821,338,-1172,-57,-1179,-821
38,LVLD@15,0,1,0,1,0,0,-1,0,-1,0
39,Damage dealt to turrets,1813,2421,4191,6558,2087,2836,0,0,0,0
40,Total heal,341,7728,104,1642,484,1493,4782,764,0,2344
41,Damage self mitigated,19110,5657,3891,6181,7360,6715,8825,5779,2015,14405
42,Time ccing others,29,21,24,11,16,9,5,9,18,9
43,Total damage taken,10813,12697,8855,8052,9056,11419,15915,11807,6911,12699